Repository: 09938797647/cryptocholy-app
Catalog: translations/*/messages.po
Languages: be, fa, pl, ru, uk, uz

# buttons.play
source: 🎢 Play
be: 🎢 Гуляць
fa: 🎢 بازی کن
pl: 🎢 Graj
ru: 🎢 Играть
uk: 🎢 Грати
uz: 🎢 O'yin o'ynang

# buttons.profile
source: 👺 Profile
be: 👺 Профіль
fa: 👺 پروفایل
pl: 👺 Profil
ru: 👺 Профиль
uk: 👺 Профіль
uz: 👺 Profil

# buttons.rating
source: 🏆 Rating
be: 🏆 Рэйтынг
fa: 🏆 امتیاز
pl: 🏆 Ranking
ru: 🏆 Рейтинг
uk: 🏆 Рейтинг
uz: 🏆 Reyting

# buttons.withdraw
source: 🛒 Withdraw
be: 🛒 Вывесці
fa: 🛒 برداشت
pl: 🛒 Wypłać
ru: 🛒 Вывести
uk: 🛒 Вивести
uz: 🛒 Olish

# buttons.back
source: 🚪 Back
be: 🚪 Назад
fa: 🚪 بازگشت
pl: 🚪 Wstecz
ru: 🚪 Назад
uk: 🚪 Назад
uz: 🚪 Orqaga

# buttons.main
source: 🚪 Main Menu
be: 🚪 Галоўнае меню
fa: 🚪 منو اصلی
pl: 🚪 Menu główne
ru: 🚪 Главное меню
uk: 🚪 Головне меню
uz: 🚪 Asosiy menyuga

# buttons.exit
source: 🚪 Exit
be: 🚪 Выхад
fa: 🚪 خروج
pl: 🚪 Wyjście
ru: 🚪 Выход
uk: 🚪 Вихід
uz: 🚪 Chiqish

# buttons.play_again
source: 🎢 Play Again
be: 🎢 Гуляць яшчэ раз
fa: 🎢 دوباره بازی کن
pl: 🎢 Graj ponownie
ru: 🎢 Играть снова
uk: 🎢 Грати знову
uz: 🎢 Qayta o'ynang

# buttons.choice_take
source: 🥷 Take
be: 🥷 Узяць
fa: 🥷 بگیر
pl: 🥷 Weź
ru: 🥷 Забрать
uk: 🥷 Забрати
uz: 🥷 Olish

# buttons.choice_split
source: 🤝 Split
be: 🤝 Раздзеліць
fa: 🤝 تقسیم
pl: 🤝 Podziel
ru: 🤝 Разделить
uk: 🤝 Розділити
uz: 🤝 Bo'lish

# buttons.choice_skip
source: 💤 Skip
be: 💤 Спаць
fa: 💤 خوابیدن
pl: 💤 Pomiń
ru: 💤 Спать
uk: 💤 Спати
uz: 💤 Uxlash

# buttons.rating_prizes
source: 🪙 Prize
be: 🪙 Выйграш
fa: 🪙 جوایز
pl: 🪙 Nagrody
ru: 🪙 Выигрыш
uk: 🪙 Виграш
uz: 🪙 Muktazilari

# buttons.rating_balance
source: 🪙 Balance
be: 🪙 Баланс
fa: 🪙 موجودی
pl: 🪙 Saldo
ru: 🪙 Баланс
uk: 🪙 Баланс
uz: 🪙 Balans

# buttons.rating_games
source: 🎲 Games
be: 🎲 Гульні
fa: 🎲 بازی‌ها
pl: 🎲 Gry
ru: 🎲 Игры
uk: 🎲 Ігри
uz: 🎲 O'yinlar

# buttons.rating_wins
source: 🥇 Wins
be: 🥇 Перамогі
fa: 🥇 پیروزی‌ها
pl: 🥇 Wygrane
ru: 🥇 Победы
uk: 🥇 Перемоги
uz: 🥇 G'alabalar

# messages.access_error
source: You cannot use this bot as you do not have a subscription to Telegram Premium. @premiumbot
be: Вы не можаце выкарыстоўваць гэтага бота, бо у вас няма падпіскі на Telegram Premium. @premiumbot
fa: شما نمی‌توانید از این ربات استفاده کنید چون اشتراک Telegram Premium ندارید. @premiumbot
pl: Nie możesz używać tego bota, ponieważ nie masz subskrypcji Telegram Premium. @premiumbot
ru: Вы не можете использовать этого бота, так как у вас нет подписки на Telegram Premium. @premiumbot
uk: Ви не можете використовувати цього бота, оскільки у вас немає підписки на Telegram Premium. @premiumbot
uz: Siz bu botdan foydalanolmaysiz, chunki sizda Telegram Premium obuna yo'q. @premiumbot

# messages.unhandled_error
source: Oops. Try restarting me with the /start command.
be: Упс. Паспрабуйце перазагрузіць мяне камандай /start.
fa: اوه! سعی کنید من را با دستور /start دوباره راه اندازی کنید.
pl: Ups. Spróbuj ponownie uruchomić mnie komendą /start.
ru: Упс. Попробуйте перезапустить меня командой /start.
uk: Упс. Спробуйте перезапустити мене командою /start.
uz: Ooops. Qaytadan boshlash uchun /start buyrug'ini kiriting.

# messages.balance
source: Your balance: {balance_formatted} points
be: Ваш баланс: {balance_formatted} балаў
fa: موجودی شما: {balance_formatted} امتیاز
pl: Twój stan konta: {balance_formatted} punktów
ru: Ваш баланс: {balance_formatted} points
uk: Ваш баланс: {balance_formatted} бали
uz: Sizning balansingiz: {balance_formatted} ball

# messages.welcome_text
source: ✨ Welcome to the game. Do you want to win up to 10,000,000 Notcoin? And so do other players. Will you get the coins? Or nothing? Let's see. The rules are simple: you need to accumulate the required sum of points to withdraw them into Notcoin. Each round, you are offered to take the entire sum for yourself or split it in half with your opponent. If both choose to take, no one gets anything. If one chooses to take and the other to split, the first one takes it all. If both choose to split, both get an equal share. To motivate you a bit more, remember that when you lose, you start the game with 0 points ✨
be: ✨ Вітаем ў гульні. Хочаце выграць да 10,000,000 Notcoin? І іншыя гульцы таксама. Ці атрымаеце вы манеты? Ці нічога? Давайце паглядзім. Правілы простыя: вам трэба назбіраць неабходную суму балаў, каб вывесці іх у Notcoin. Кожны раўнд вам прапануецца ўзяць сабе ўсю суму ці падзяліцца на палам з супернікам. Калі абодва выбіраюць узяць, нікому нішто не дастаецца. Калі хто-небудзь выбірае ўзяць, а другі падзяліцца, першы забірае ўсё. Калі абодва выбіраюць падзяліцца, абоды атрымліваюць па роўнай. Каб падзарадзіць вас нейка больш, памятайце, што, калі вы працуеце, вы пачынаеце гульню з 0 балаў ✨
fa: ✨ به بازی خوش آمدید. آیا می‌خواهید تا ۱۰،۰۰۰،۰۰۰ Notcoin ببرید؟ و دیگر بازیکنان هم همینطور. آیا سکه‌ها را خواهید گرفت؟ یا هیچ؟ بیایید ببینیم. قوانین ساده است: باید مقدار لازم امتیاز را جمع کنید تا بتوانید آنها را به Notcoin وارد کنید. در هر دور، شما می‌توانید تمام مبلغ را به دست آورید یا آن را به نصف با حریف تقسیم کنید. اگر هر دو نفر برای گرفتن را انتخاب کنند، هیچکس هیچچیزی دریافت نخواهد کرد. اگر کسی گرفتن را انتخاب کند و دیگری تقسیم کند، اولیه همه چیز را خواهد گرفت. اگر هر دوی شما تصمیم به تقسیم بگیرید، هر دو نفر برابر دریافت خواهند کرد. برای شما انگیزه بیشتری بدهیم، به یاد داشته باشید که هنگامی که باخت می‌کنید، بازی را با ۰ امتیاز شروع می‌کنید ✨
pl: ✨ Witaj w grze. Chcesz wygrać do 10 000 000 Notcoin? A inni gracze także. Czy zdobędziesz monety? Czy nic? Zobaczmy. Zasady są proste: musisz zdobyć wymaganą liczbę punktów, aby wypłacić je w Notcoin. W każdej rundzie masz możliwość wzięcia całej kwoty lub podzielenia jej na pół z przeciwnikiem. Jeśli obaj wybierzecie wzięcie, nikt nic nie dostanie. Jeśli ktoś wybierze wzięcie, a drugi podzielenie, to pierwszy otrzyma całość. Jeśli obaj wybierzecie podzielenie, oboje otrzymacie po równo. Aby cię trochę zmotywować, pamiętaj, że gdy przegrywasz, zaczynasz grę od 0 punktów ✨
ru: ✨ Добро пожаловать в игру. Хотите выиграть до 10,000,000 Notcoin? И другие игроки тоже. Получите ли вы монеты? Или ничего? Давайте посмотрим. Правила просты: нужно накопить необходимую сумму points чтобы вывести их в Notcoin. Каждый раунд вам предлагают забрать себе всю сумму или разделить её пополам с оппонентом. Если вы оба выбрали забрать, никому не достанется ничего. Если кто-то выбирает забрать а второй разделить, то первый забирает всё. Если оба выбрали разделить — оба получат поровну. Чтобы мотивировать вас немного больше, помните, что, когда вы проигрываете, вы начинаете игру с 0 points ✨
uk: ✨ Ласкаво просимо до гри. Хочете виграти до 10,000,000 Notcoin? І інші гравці теж. Отримаєте ви монети? Чи нічого? Давайте подивимося. Правила прості: вам потрібно накопичити необхідну суму балів, щоб вивести їх в Notcoin. Кожен раунд вам пропонують забрати собі всю суму або поділити її пополам з опонентом. Якщо обидва вибирають забрати, нікому нічого не дістанеться. Якщо хтось вибирає забрати, а другий поділити, то перший забирає все. Якщо обидва вибирають поділити - обидва отримують порівну. Щоб мотивувати вас трошки більше, пам'ятайте, що, коли ви програєте, ви починаєте гру з 0 балів ✨
uz: ✨ O'yiniga xush kelibsiz. Uning orqali 10,000,000 Notcoin ga qanday hissa olishni xohlaysizmi? Boshqa o'yinchilar ham shunday. Siz monetlarni olishasizmi? Yo'qmi? To'g'ri, ko'ramiz. Qoidalar oddiy: Notcoin ga chiqarish uchun zarur bo'lgan ballarni to'plashingiz kerak. Har bir raundda sizga to'liq summani olish yoki uning yarimiga bo'lish imkoniyati beriladi. Agar siz ikkala tomon ham olishni tanlarsangiz, hech kim hech narsa olmaydi. Agar biror kishi olishni tanlagan bo'lsa, boshqa nimadir o'lmaydi. Agar ikkala tomon ham bo'lishni tanlasa, ular o'rtasida teng bo'ladilar. Sizni chidramoq uchun, tanlaganizni xotirlab oling, agar siz yo'qotishni tanlarsangiz, siz o'yiniga 0 ball bilan boshlarsiz ✨

# messages.profile_text
source: What will you get in the end? Probably nothing. Will you learn something? Definitely.
be: Што вы атрымаеце ў канцы? Магчыма, нічога. Ці дазнаеце вы што-небудзь? Абаладзейна.
fa: در انتها چه چیزی به دست خواهید آورد؟ احتمالاً هیچ چیز. آیا چیزی یاد می‌گیرید؟ بدون شک.
pl: Co zyskasz na końcu? Prawdopodobnie nic. Czy dowiesz się czegoś? Zdecydowanie.
ru: Что вы получите в конце? Вероятно, ничего. Узнаете ли вы что-то? Определенно.
uk: Що ви отримаєте в кінці? Можливо, нічого. Чи дізнаєтеся ви щось? Так чи ні.
uz: O'yin tugaganida, siz nima qoladi? Ehtimol, hech narsa. Siz nima bilasizmi? Batafsil.

# messages.user_prizes
source: Received Notcoins: {prizes_formatted} Notcoin will be credited to your account in the @notcoin_bot after the end of this activity.
be: Атрыманыя Notcoin: {prizes_formatted} Notcoin будуць зарахаваныя на ваш рахунак у боте @notcoin_bot пасля заканчэння гэтай актыўнасці.
fa: Notcoin دریافتی شما: {prizes_formatted} Notcoin به حساب شما در ربات @notcoin_bot پس از پایان این فعالیت واریز خواهند شد.
pl: Otrzymane Notcoin: {prizes_formatted} Notcoin zostaną przypisane do twojego konta w bocie @notcoin_bot po zakończeniu tej aktywności.
ru: Полученные Notcoin: {prizes_formatted} Notcoin будут зачислены на ваш аккаунт в боте @notcoin_bot после окончания этой активности.
uk: Отримані Notcoin: {prizes_formatted} Notcoin будуть зараховані на ваш рахунок в боті @notcoin_bot після завершення цієї активності.
uz: Olingan Notcoin lar: {prizes_formatted} Notcoin lar @notcoin_bot botdagi hisobingizga bu faoliyat tugagandan so'ng o'tkaziladi.

# messages.withdraw_text
source: In each round, you can earn or lose points. When your balance reaches the required sum, you can withdraw them to your Notcoin account. In the profile tab, you can see your current balance.
be: У кожным раўндзе вы можаце зарабіць або страціць балы. Калі на вашым рахунку назбіраецца неабходная сума, вы зможаце вывесці іх на свой рахунак у Notcoin. У раздзеле профіль вы можаце ўбачыць свой бягучы баланс.
fa: در هر دور ممکن است امتیازاتی کسب یا از دست داده شود. وقتی موجودی شما به مقدار مورد نیاز برسد، می‌توانید آنها را به حساب Notcoin خود واریز کنید. در تب پروفایل، موجودی فعلی خود را مشاهده کنید.
pl: W każdej rundzie możesz zarobić lub stracić punkty. Gdy na twoim koncie uzbiera się wymagana suma, będziesz mógł wypłacić je na swoje konto Notcoin. W zakładce profil możesz sprawdzić swoje obecne saldo.
ru: В каждом раунде вы можете заработать или потерять points. Когда на вашем балансе наберется необходимая сумма, вы сможете вывести их на свой счёт в Notcoin. Во вкладке профиль вы можете увидеть свой текущий баланс.
uk: В кожному раунді ви можете заробити або втратити бали. Коли на вашому рахунку накопичиться необхідна сума, ви зможете вивести їх на свій рахунок в Notcoin. У вкладці профіль ви можете побачити свій поточний баланс.
uz: Har bir raundda siz ball yutib, yoki yo'qotishingiz mumkin. Hisobingizdagi mablag' to'liq summasiga yetganda, ularni Notcoin hisobingizga o'tkazishingiz mumkin. Profil bo'limida joriy balansingizni ko'rasiz.

# messages.current_round_rules
source: You need to earn {target} points, then you will receive a prize in Notcoin, which will be automatically credited to your balance in @notcoin_bot. Total number of available prizes in this round for all players: {available_prizes}/{max_prizes} Prizes claimed by you in this round out of possible: {claimed_prizes_user}/{max_prizes_per_user}
be: Вам трэба назьбіраць {target} балаў, тады вы атрымаеце прыз у Notcoin, які пазней будзе аўтаматычна залічаны на ваш балянс у @notcoin_bot. Агульная колькасць даступных прызаў у гэтым раунде для ўсіх гульцоў: {available_prizes}/{max_prizes} Атрыманых вамі прызаў у гэтым раунде з магчымых: {claimed_prizes_user}/{max_prizes_per_user}
fa: شما باید {target} امتیاز جمع کنید، سپس یک جایزه در Notcoin دریافت خواهید کرد که به صورت خودکار به موجودی شما در @notcoin_bot افزوده می‌شود. مجموع تعداد جوایز موجود در این دوره برای همه بازیکنان: {available_prizes}/{max_prizes} جوایزی که شما در این دوره دریافت کرده‌اید از مجموع ممکن: {claimed_prizes_user}/{max_prizes_per_user}
pl: Musisz zdobyć {target} punktów, wtedy otrzymasz nagrodę w Notcoin, która zostanie automatycznie przypisana do Twojego salda w @notcoin_bot. Łączna liczba dostępnych nagród w tej rundzie dla wszystkich graczy: {available_prizes}/{max_prizes} Nagrody, które otrzymałeś w tej rundzie spośród możliwych: {claimed_prizes_user}/{max_prizes_per_user}
ru: Вам нужно собрать {target} points, тогда вы получите приз в Notcoin, который позже будет автоматически зачислен на ваш баланс в @notcoin_bot. Общее количество доступных призов в этом раунде для всех игроков: {available_prizes}/{max_prizes} Получено вами призов в этом раунде из возможных: {claimed_prizes_user}/{max_prizes_per_user}
uk: Вам потрібно зібрати {target} балів, тоді ви отримаєте приз в Notcoin, який пізніше буде автоматично зарахований на ваш баланс в @notcoin_bot. Загальна кількість доступних призів у цьому раунді для всіх гравців: {available_prizes}/{max_prizes} Отриманих вами призів у цьому раунді з можливих: {claimed_prizes_user}/{max_prizes_per_user}
uz: Siz {target} ball to'plashingiz kerak, keyin siz Notcoin-da mukofot olishingiz mumkin, undan so'ng avtomatik ravishda @notcoin_bot-dagi hisobingizga kiritiladi. Umumiy mavjud mukofotlar: {available_prizes}/{max_prizes} Siz uchun mavjud mukofotlar: {claimed_prizes_user}/{max_prizes_per_user} ushbu raundda

# messages.no_active_round
source: No active round. Just have fun and practice 💪
be: Няма актыўнага раўнду. Проста веселіцеся і трэніруйцеся 💪
fa: هیچ دور فعالی وجود ندارد. فقط لذت ببرید و تمرین کنید 💪
pl: Brak aktywnej rundy. Po prostu baw się i trenuj 💪
ru: Нет активного раунда. Просто веселитесь и тренируйтесь 💪
uk: Немає активного раунду. Просто розважайтеся та тренуйтеся 💪
uz: Faol raund yo'q. Faqat zo'r bo'ling va trening qiling 💪

# messages.game_in_progress
source: You already have an active game. Finish your previous game before starting a new one
be: У вас ўжо ёсць актыўная гульня. Завяршыце папярэднюю гульню перад тым, як пачаць новую
fa: شما در حال حاضر یک بازی فعال دارید. قبل از شروع بازی جدید، بازی قبلی را به اتمام برسانید
pl: Masz już aktywną grę. Zakończ poprzednią grę, zanim zaczniesz nową
ru: У вас уже есть активная игра. Закончите прошлую игру перед тем, как начать новую
uk: В вас вже є активна гра. Завершіть попередню гру перед тим, як почати нову
uz: Sizda hozir faol o'yin mavjud. Yangi o'yin boshlashdan oldin oldingi o'yinni tugating

# messages.good_luck
source: 🚀 Good luck!
be: 🚀 Удачы!
fa: 🚀 موفق باشید!
pl: 🚀 Powodzenia!
ru: 🚀 Удачи!
uk: 🚀 Удачі!
uz: 🚀 Omad!

# messages.lobby_text
source: Press Play to start searching for an opponent ⚡ Don't sleep: after the game starts, you have only {max_round_time} seconds to make a decision.
be: Націсніце Гуляць, каб пачаць пошук суперніка ⚡ Не спіце: пасля пачатку гульні у вас ёсць толькі {max_round_time} секунд, каб прыняць рашэнне.
fa: برای شروع جستجوی حریف، روی بازی کلیک کنید ⚡ خواب نخواهید کرد: بعد از شروع بازی، شما تنها {max_round_time} ثانیه وقت دارید تا تصمیم بگیرید.
pl: Naciśnij Graj, aby rozpocząć wyszukiwanie przeciwnika ⚡ Nie śpij: po rozpoczęciu gry masz tylko {max_round_time} sekund, aby podjąć decyzję.
ru: Нажмите Играть, чтобы начать поиск оппонента ⚡ Не спите: после начала игры у вас есть всего {max_round_time} секунд, чтобы принять решение.
uk: Натисніть Грати, щоб почати пошук опонента ⚡ Не спіть: після початку гри у вас є всього {max_round_time} секунд, щоб прийняти рішення.
uz: O'yinchi topilganda O'yin tugaganidan keyin uzingizni tanlovingiz mumkin ⚡ Uxlamang: O'yin boshlandi kuni, sizda faqat {max_round_time} soniyadan foydalanishingiz mumkin, qaror qabul qilish uchun.

# messages.choices_summary
source: You chose {action} Player {rival_name} chose: {opponent_action}
be: Вы выбралі {action} Гулец {rival_name} выбраў: {opponent_action}
fa: شما {action} را انتخاب کرده‌اید بازیکن {rival_name} {opponent_action} را انتخاب کرده است
pl: Wybrałeś {action} Gracz {rival_name} wybrał: {opponent_action}
ru: Вы выбрали {action} Игрок {rival_name} выбрал: {opponent_action}
uk: Ви вибрали {action} Гравець {rival_name} вибрав: {opponent_action}
uz: Siz {action} tanladingiz O'yinchi {rival_name} {opponent_action} tanladi

# messages.loser_text
source: 😬 You lost {lose_amount} points. Want to try again?
be: 😬 Вы стратілі {lose_amount} балаў. Паспрабуйце яшчэ?
fa: 😬 شما {lose_amount} امتیاز را از دست داده‌اید. می‌خواهید دوباره امتحان کنید؟
pl: 😬 Straciłeś {lose_amount} punktów. Spróbujemy jeszcze raz?
ru: 😬 Вы потеряли {lose_amount} points. Попробуем ещё?
uk: 😬 Ви втратили {lose_amount} бали. Спробуєте ще?
uz: 😬 Siz {lose_amount} ball yo'qotdingiz. Qayta urinib ko'ringizmi?

# messages.balance_flush_text
source: And, oh no — you're starting this game from scratch again... 🩲 Good thing it's just a game. Or is it? 😐
be: І, о жах — вы зноў пачынаеце гэтую гульню з нуля... 🩲 Добра што гэта толькі гульня. Ці не?
fa: وای، شما دوباره این بازی را از ابتدا شروع می‌کنید... 🩲 خوب که این تنها یک بازی است. یا نه؟ 😐
pl: I, o zgrozo - zaczynasz tę grę od nowa... 🩲 Dobrze, że to tylko gra. A może nie? 😐
ru: И, о ужас — вы снова начинаете эту игру с нуля... 🩲 Хорошо что это всего лишь игра. Или нет? 😐
uk: І, о жах - ви знову починаєте цю гру з нуля... 🩲 Добре, що це просто гра. Або ні? 😐
uz: Yiqilganini qayd etingiz - siz yana o'zringizni nolga qo'yib, yana o'ynayapsiz... 🩲 Yaxshi, bu faqat o'yin. Yoki emasmi? 😐

# messages.balance_summary_full_text
source: Your current balance - {balance} points
be: Ваш бягучы баланс - {balance} балаў
fa: موجودی فعلی شما - {balance} امتیاز
pl: Twój obecny stan konta - {balance} punktów
ru: Ваш текущий баланс - {balance} points
uk: Ваш баланс - {balance} балів
uz: Joriy balansingiz - {balance} ball

# messages.winner_text
source: 🥳 You won {won_amount} points, congratulations!
be: 🥳 Вы атрымалі {won_amount} балаў, віншую!
fa: 🥳 شما {won_amount} امتیاز دریافت کردید، تبریک!
pl: 🥳 Otrzymałeś {won_amount} punktów, gratulacje!
ru: 🥳 Вы получили {won_amount} points, поздравляю!
uk: 🥳 Ви отримали {won_amount} балів, вітаємо!
uz: 🥳 Siz {won_amount} ball olishingiz mumkin, tabriklaymiz!

# messages.prize_winner_text
source: 🎉🎉🎉 Congratulations {full_name}! 🎉🎉🎉You earned {amount} Notcoin! They will be credited to your @notcoin_bot account before token release. Meanwhile, keep playing and try to earn more!
be: 🎉🎉🎉 Віншуем {full_name}! 🎉🎉🎉Вы заробілі {amount} Notcoin! Яны будуць зарахаваныя на ваш рахунак у @notcoin_bot да выпуску токена. А пакуль гуляйце і старайцеся заробіць больш!
fa: 🎉🎉🎉 تبریک می‌گوییم {full_name}! 🎉🎉🎉شما {amount} Notcoin کسب کردید! آنها قبل از صدور توکن به حساب شما در @notcoin_bot واریز خواهند شد. تا زمانی که ادامه دهید و سعی کنید بیشتر بکسبید!
pl: 🎉🎉🎉 Gratulacje {full_name}! 🎉🎉🎉Zdobyłeś {amount} Notcoin! Zostaną one przypisane do twojego konta w @notcoin_bot przed wydaniem tokena. Tymczasem graj dalej i postaraj się zdobyć więcej!
ru: 🎉🎉🎉 Поздравляем {full_name}! 🎉🎉🎉Вы заработали {amount} Notcoin! Они будут начислены на ваш счет в @notcoin_bot перед выпуском токена. А пока продолжайте играть и постарайтесь заработать больше!
uk: 🎉🎉🎉 Вітаємо {full_name}! 🎉🎉🎉Ви заробили {amount} Notcoin! Вони будуть зараховані на ваш рахунок в @notcoin_bot перед випуском токена. Тим часом грайте далі і намагайтеся заробити більше!
uz: 🎉🎉🎉 Tabriklaymiz {full_name}! 🎉🎉🎉Siz {amount} Notcoin topdingiz! Ular notcoin_bot dagi hisobingizga tegishli hisobga o'tkaziladi. Bu orada davom etib, ko'proq ishlab topishingizni urinib ko'ring!

# messages.time_to_decide
source: ...time to decide
be: ...час вырашаць
fa: ...زمان تصمیم‌گیری
pl: ...czas na decyzję
ru: ...время выбирать
uk: ...час вирішувати
uz: ...qaror qabul qilish vaqt

# messages.waiting_other_move
source: You made your choice. You can still change it until the time runs out or until {rival_name} makes their move.
be: Вы зрабілі свой выбар. Вы яшчэ можаце змяніць яго, пакуль не скончыцца час або пакуль {rival_name} не зрабіць свой ход.
fa: شما تصمیم خود را گرفته‌اید. همچنان می‌توانید آن را تغییر دهید تا زمانی که زمان به اتمام نرسد یا {rival_name} حرکت خود را انجام دهد.
pl: Podjąłeś swoją decyzję. Nadal możesz ją zmienić, dopóki nie minie czas lub dopóki {rival_name} nie podjął swojego ruchu.
ru: Вы сделали свой выбор. Вы всё ещё можете изменить его, пока не истечет время или пока {rival_name} не сделает свой ход.
uk: Ви зробили свій вибір. Ви все ще можете його змінити, поки не мине час або поки {rival_name} не зробить свій хід.
uz: Siz qaroringizni tanlagansiz. Vaqt tugagandan yoki {rival_name} qarorini o'zgartirishga qandaydir qaror qilgandan oldin, siz uni o'zgartirishingiz mumkin.

# messages.player_history
source: Your choice in recent games: {last_games}
be: Ваш выбар у апошніх гульнях: {last_games}
fa: انتخاب شما در بازی‌های اخیر: {last_games}
pl: Twój wybór w ostatnich grach: {last_games}
ru: Ваш выбор в недавних играх: {last_games}
uk: Ваш вибір в нещодавніх іграх: {last_games}
uz: Oxirgi o'yinlaringizda tanlaganlaringiz: {last_games}

# messages.rival_history
source: Previous choice of player {rival_name}: {last_opponent_games}
be: Папярэдні выбар гульца {rival_name}: {last_opponent_games}
fa: انتخاب قبلی بازیکن {rival_name}: {last_opponent_games}
pl: Ostatni wybór gracza {rival_name}: {last_opponent_games}
ru: Предыдущий выбор игрока {rival_name}: {last_opponent_games}
uk: Попередній вибір гравця {rival_name}: {last_opponent_games}
uz: {rival_name} o'zgartirilgan tanlov qaydnomasi: {last_opponent_games}

# messages.waiting
source: ⌛️ Searching for an opponent. Wait while we find a player...
be: ⌛️ Пошук суперніка. Пачакайце, пакуль мы шукаем гульца...
fa: ⌛️ در حال جستجو برای حریف. لطفاً منتظر بمانید تا یک بازیکن پیدا کنیم...
pl: ⌛️ Wyszukiwanie przeciwnika. Poczekaj, aż znajdziemy gracza...
ru: ⌛️ Поиск оппонента. Подождите, пока мы ищем игрока...
uk: ⌛️ Пошук опонента. Зачекайте, доки ми шукаємо гравця...
uz: ⌛️ Raqibni izlash. Kutib turing, biz o'yinchini izlaymiz...

# messages.player_found
source: Player found. Now make your choice.
be: Гулец знойдзены. Цяпер зрабіце свой выбар.
fa: بازیکن یافت شد. حالا تصمیم خود را بگیرید.
pl: Znaleziono gracza. Teraz dokonaj swojego wyboru.
ru: Игрок найден. Теперь сделайте свой выбор.
uk: Гравець знайдений. Тепер зробіть свій вибір.
uz: O'yinchi topildi. Hozir o'zingizni tanlovingiz mumkin.

# messages.rating_text
source: 🏆 Top players
be: 🏆 Топ гульцоў
fa: 🏆 برترین‌ها
pl: 🏆 Top graczy
ru: 🏆 Топ игроков
uk: 🏆 Топ гравців
uz: 🏆 Eng yaxshi o'yinchilar
